app/controllers/api/v1/authentication_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'usuario1@test.com' LIMIT 1
---
    def login
        @user = User.find_by(email: params[:email])