app/controllers/api/v1/orders_controller.rb

    def create
        @order = Order.new(order_params)
        @order.total_order = calculate_order_total(order_params[:order_has_products_attributes])
        @order.date_order = Date.current
        @order.status_order = "Recibida"
        @order.user_id = @current_user.id

        if params[:order][:order_has_products_attributes].present?
            order_has_products_params = params[:order][:order_has_products_attributes].map do |product_params|
                product_id = product_params[:product_id].to_i
                cant = product_params[:cant].to_i

                product = Product.find_by(id: product_id)
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1

            params[:order][:order_has_products_attributes] = order_has_products_params
        end

        if @order.save
---
INSERT INTO `orders` (`num_order`, `date_order`, `total_order`, `status_order`, `created_at`, `updated_at`, `user_id`) VALUES (1, '2024-02-01', 6000, 'Recibida', '2024-02-01 19:57:29.567945', '2024-02-01 19:57:29.567945', 1)