app/controllers/api/v1/products_controller.rb

    def products
        @products = Product.all
---
SELECT `products`.* FROM `products`

    def create
        @product = Product.new(product_params)
        if @product.save
---
INSERT INTO `products` (`name`, `price`, `quantity`, `created_at`, `updated_at`) VALUES ('Producto 4', 5000, 80, '2024-02-01 03:05:07.804623', '2024-02-01 03:05:07.804623')

    def update
        if @product.update(product_params)
---
UPDATE `products` SET `products`.`quantity` = 90, `products`.`updated_at` = '2024-02-01 03:18:00.745177' WHERE `products`.`id` = 4

    def destroy
        if @product.destroy
---
DELETE FROM `products` WHERE `products`.`id` = 2

    def set_product
        @product = Product.find_by(id: params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1