app/controllers/api/v1/users_controller.rb

SELECT `users`.* FROM `users`
---
    def users
        @users = User.all

INSERT INTO `users` (`name`, `email`, `username`, `password_digest`, `role`, `created_at`, `updated_at`) VALUES ('usuario 1', 'usuario1@test.com', 'usuariox', '$2a$12$1HKPyLlhmMOGq2jE9FSdf.YI3RQ.yu3tYu5n.G1Bfqw3ZEw0JErf2', 'user', '2024-02-01 16:05:40.978947', '2024-02-01 16:05:40.978947')
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
    def set_user
        @user = User.find_by(id: params[:id])