app/controllers/application_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
    def authenticate_request
        puts "Auth token: #{auth_token}"
        render_failed and return unless token?
	    @current_user = User.find_by(id: auth_token[:user_id])