app/models/order.rb

    def set_num_order
        last_order = Order.order(num_order: :desc).first
---
SELECT `orders`.* FROM `orders` ORDER BY `orders`.`num_order` DESC LIMIT 1